porousBlockage/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;
// square intake length 1.2
vertices
(
    (0  0  0) //0
    (8.534   0 0) //1
    (8.534   3.4036 0) //2
    (0  3.4036 0) //3
    (0  0  8.534) //4
    (8.534   0  8.534) //5
    (8.534   3.4036  8.534) //6
    (0  3.4036  8.534) //7
    (7.534  3.4036  3.667) //8
    (7.534  3.4036  4.867) //9
    (6.334  3.4036  3.667) //10
    (6.334  3.4036  4.867) //11
    (2.2  3.4036  3.667) //12
    (2.2  3.4036  4.867) //13
    (1  3.4036  3.667) //14
    (1  3.4036  4.867) //15
    (7.534  0  3.667) //16
    (7.534  0  4.867) //17
    (6.334  0  3.667) //18
    (6.334  0  4.867) //19
    (2.2  0  3.667) //20
    (2.2  0  4.867) //21
    (1  0  3.667) //22
    (1  0  4.867) //23
    (1   0 0) //24
    (1   0 8.534) //25
    (1   3.4036 0) //26
    (1   3.4036 8.534) //27
    (2.2   0 0) //28
    (2.2   0 8.534) //29
    (2.2   3.4036 0) //30
    (2.2   3.4036 8.534) //31
    (6.334   0 0) //32
    (6.334   0 8.534) //33
    (6.334   3.4036 0) //34
    (6.334   3.4036 8.534) //35
    (7.534   0 0) //36
    (7.534   0 8.534) //37
    (7.534   3.4036 0) //38
    (7.534   3.4036 8.534) //39
    
    (7.534   -0.1 8.534) //40
    (0   -0.1 8.534) //41
    (7.534   -0.1 0) //42
    (0   -0.1 0) //43
    (7.534   -0.2 8.534) //44
    (0   -0.2 8.534) //45
    (7.534   -0.2 0) //46
    (0   -0.2 0) //47
    
);

blocks
(
    hex (0 24 26 3 4 25 27 7) (11 20 100) simpleGrading (1 1 1)
    hex (24 28 30 26 22 20 12 14) (28 20 36) simpleGrading (1 1 1)
    hex (28 32 34 30 29 33 35 31) (50 20 100) simpleGrading (1 1 1)
    hex (23 21 13 15 25 29 31 27) (28 20 36) simpleGrading (1 1 1)
    hex (22 20 12 14 23 21 13 15) (28 20 28) simpleGrading (1 1 1)
    
    //hex (24 18 10 26 25 19 11 27) (11 20 100) simpleGrading (1 1 1)
    hex (32 36 38 34 18 16 8 10) (28 20 36) simpleGrading (1 1 1)
    hex (36 1 2 38 37 5 6 39) (11 20 100) simpleGrading (1 1 1)
    hex (19 17 9 11 33 37 39 35) (28 20 36) simpleGrading (1 1 1)
    hex (18 16 8 10 19 17 9 11) (28 20 28) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (14 12 13 15)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (10 8 9 11)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 26 27 7)
            (26 30 12 14)
            (15 27 31 13)
            (30 31 35 34)
            
            (34 10 8 38)
            //(26 27 11 10)
            (11 35 39 9)
            (38 39 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (

            (0 24 25 4)
            (24 28 20 22)
            (23 21 29 25)
            (28 29 33 32)
            (22 23 21 20)
            
            (32 18 16 36)
            //(24 25 19 18)
            (19 33 37 17)
            (36 37 5 1)
            (18 19 17 16)
        );
    }

    sideway
    {
        type wall;
        faces
        (
            (0 3 26 24)
            (0 3 7 4)
            (4 7 27 25)
            
            (24 26 30 28)
            (25 27 31 29)
            (28 30 34 32)
            (29 31 35 33)
            (32 34 38 36)
            (33 35 39 37)
            (36 38 2 1)
            (1 2 6 5)
            (37 39 6 5)
        );
    }
);

// ************************************************************************* //
